Revit 2027 API
OverrideGraphicSettings.SetCutLineColor Method
 Sets the cut surface line color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutLineColor(
	Color color
)
Public Function SetCutLineColor (
	color As Color
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutLineColor(
	Color^ color
)
member SetCutLineColor :
        color : Color -> OverrideGraphicSettings
Parameters
color Color
 Value of the cut surface line color for the override. InvalidColorValue means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace